import '../models/dua_class.dart';

final List<Dua> morningDuasList = const [
  Dua(
      header: 'دعاء ١',
      title: "قال رسول الله صلى الله عليه وسلم :-",
      description:
          'من  قالَ  حينَ  يصبحُ  اللَّهمَّ  ما  أصبحَ  بي من  نعمةٍ  أو  بأحدٍ  من  خلقِكَ  فمنكَ  وحدَكَ  لا  شريكَ  لكَ  فلكَ  الحمدُ  ولكَ  الشُّكرُ  فقد  أدَّى  شكرَ  يومِهِ  ومن  قالَ  مثلَ  ذلكَ  حينَ  يمسي  فقد  أدَّى  شكرَ  ليلتِهَِ'),
  Dua(
    header: 'دعاء ٢',
    title: "قال رسول الله صلى الله عليه وسلم :-",
    description:
        ' اللَّهُمَّ  إنِّي  أصبَحتُ  أُشهِدُك،  وأُشهِدُ  حَمَلةَ  عَرشِكَ،  ومَلائِكَتَك،  وجميعَ  خَلقِكَ:  أنَّكَ  أنتَ  اللهُ  لا  إلهَ  إلَّا  أنتَ،  وأنَّ  مُحمَّدًا  عبدُكَ  ورسولُكَ',
  ),
  Dua(
    header: 'دعاء ٣',
    title: "قال رسول الله صلى الله عليه وسلم :-",
    description:
        'مَن  قال:  بسمِ  اللهِ  الذي  لا  يَضرُ  مع  اسمِه  شيءٌ  في  الأرضِ  ولا  في  السماءِ  وهو  السميعُ  العليمِ،  ثلاثُ  مراتٍ،  لم  تصبْه  فجأةُ  بلاءٍ  حتى  يُصبحَ،  ومَن  قالها  حينَ  يُصبحُ  ثلاثَ  مراتٍ  لم  تُصبْه  فجأةُ  بلاءٍ  حتى  يُمسي',
  ),
  Dua(
    header: 'دعاء ٤',
    title: "قال رسول الله صلى الله عليه وسلم :-",
    description:
        ' مَن  قالَ  حينَ  يصبحُ  وحينَ  يُمسي:  سبحانَ  اللَّهِ  وبحمدِهِ  مائةَ  مرَّةٍ،  لم  يأتِ  أحدٌ  يومَ  القيامةِ  بأفضلَ  ممَّا  جاءَ  بِهِ،  إلَّا  أحدٌ  قالَ  مثلَ  ما  قالَ،  أو  زادَ  علَيهِ',
  ),
  Dua(
    header: 'دعاء ٥',
    title: "قال رسول الله صلى الله عليه وسلم :-",
    description:
        ' سَيِّدُ  الِاسْتِغْفارِ  أنْ  تَقُولَ:  اللَّهُمَّ  أنْتَ  رَبِّي  لا  إلَهَ  إلَّا  أنْتَ،  خَلَقْتَنِي  وأنا  عَبْدُكَ،  وأنا علَى  عَهْدِكَ  ووَعْدِكَ  ما  اسْتَطَعْتُ،  أعُوذُ  بكَ  مِن  شَرِّ  ما  صَنَعْتُ،  أبُوءُ  لكَ  بنِعْمَتِكَ  عَلَيَّ،  وأَبُوءُ  لكَ  بذَنْبِي  فاغْفِرْ  لِي،  فإنَّه  لا  يَغْفِرُ  الذُّنُوبَ  إلَّا  أنْتَ،  قالَ:  ومَن  قالَها  مِنَ  النَّهارِ  مُوقِنًا  بها،  فَماتَ  مِن  يَومِهِ  قَبْلَ  أنْ  يُمْسِيَ،  فَهو  مِن  أهْلِ  الجَنَّةِ،  ومَن  قالَها  مِنَ  اللَّيْلِ  وهو  مُوقِنٌ  بها،  فَماتَ  قَبْلَ  أنْ  يُصْبِحَ،  فَهو  مِن  أهْلِ  الجَنَّةِ',
  ),
  Dua(
    header: 'دعاء ٦',
    title: "قال رسول الله صلى الله عليه وسلم :-",
    description:
        ' لم  يكن  رسولُ  اللهِ  -  صلَّى  اللهُ  عليهِ  وسلَّم -  يدعُ  هؤلاءِ  الدعواتِ  حين  يُمسي  وحين  يُصبحُ،  اللهمَّ  إني  أسألُك العفوَ  والعافيةَ،  في  الدنيا  والآخرةِ،  اللهمَّ  إني  أسألُك  العفوَ  والعافيةَ،  في دِيني  ودنيايَ  وأهلي  ومالي،  اللهمَّ  استُرْ  عوراتي،  وآمِنْ  روعاتي،  واحفظني  من  بين  يدي،  ومن  خلفي،  وعن  يميني،  وعن  شمالي،  ومن  فوقي،  وأعوذُ  بك  أن  أُغْتَالَ  من  تحتي',
  ),
  Dua(
    header: 'دعاء ٧',
    title: "قال رسول الله صلى الله عليه وسلم :-",
    description:
        ' اللهمَّ  إنِّي  أعوذُ  بك  من  الهمِّ  والحزنِ،  والعجزِ  والكسلِ،  والبُخلِ  والجُبنِ،  وضَلَعِ  الدَّينِ،  وغَلَبَةِ  الرجالِ',
  ),
  Dua(
    header: 'دعاء ٨',
    title: "قال رسول الله صلى الله عليه وسلم :-",
    description:
        'اللَّهمَّ  عالِمَ  الغَيبِ  والشَّهادةِ،  فاطرَ  السَّمواتِ  والأرضِ،  رَبَّ  كلِّ  شيءٍ  ومَليكَهُ،  أشهدُ  أن  لا  إلَهَ  إلَّا  أنتَ،  أعوذُ  بِكَ  مِن  شرِّ  نفسي  وشرِّ  الشَّيطانِ  وشِركِهِ،  قلهُ  إذا  أصبَحتَ،  وإذا  أمسَيتَ،  وإذا  أخَذتَ  مَضجعَكَ',
  ),
  Dua(
      header: 'دعاء ٩',
      title: "قال رسول الله صلى الله عليه وسلم :-",
      description:
          ' لفاطمة  - رضي  الله  عنها-: ما  يمنعُكِ  أن  تسمَعي ما  أوصيكِ  بِهِ  أن  تقولي  إذا  أصبَحتِ  وإذا  أمسَيتِ  يا  حيُّ  يا  قيُّومُ،  برَحمتِكَ  أستَغيثُ،  أصلِح  لي  شأني  كُلَّهُ،  ولا  تَكِلني  إلى  نَفسي  طرفةَ  عينٍ'),
];

final List<Dua> nightDuasList = const [
  Dua(
      header: 'دعاء ١',
      title: "",
      description:
          '  قراءة  آية  الكرسي  (مرّة  واحدة):  أَعُوذُ  بِاللهِ  مِنْ  الشَّيْطَانِ  الرَّجِيمِ:  «اللّهُ  لاَ  إِلَـهَ  إِلاَّ  هُوَ  الْحَيُّ  الْقَيُّومُ  لاَ  تَأْخُذُهُ  سِنَةٌ  وَلاَ  نَوْمٌ  لَّهُ  مَا  فِي  السَّمَاوَاتِ  وَمَا  فِي  الأَرْضِ  مَن  ذَا  الَّذِي  يَشْفَعُ  عِنْدَهُ  إِلاَّ  بِإِذْنِهِ  يَعْلَمُ  مَا  بَيْنَ  أَيْدِيهِمْ  وَمَا  خَلْفَهُمْ  وَلاَ  يُحِيطُونَ  بِشَيْءٍ  مِّنْ  عِلْمِهِ  إِلاَّ  بِمَا  شَاء  وَسِعَ  كُرْسِيُّهُ  السَّمَاوَاتِ  وَالأَرْضَ   وَلاَ يَؤُودُهُ  حِفْظُهُمَا  وَهُوَ  الْعَلِيُّ  الْعَظِيمُ». '),
  Dua(
      header: 'دعاء ٢',
      title: "",
      description:
          'قراءة  الآية  285 – 286  من  سورة  البقرة  (مرّة  واحدة):  أَعُوذُ  بِاللهِ  مِنْ  الشَّيْطَانِ  الرَّجِيمِ: « آمَنَ  الرَّسُولُ  بِمَا  أُنْزِلَ  إِلَيْهِ  مِنْ  رَبِّهِ  وَالْمُؤْمِنُونَ ۚ  كُلٌّ  آمَنَ  بِاللَّهِ  وَمَلَائِكَتِهِ  وَكُتُبِهِ  وَرُسُلِهِ  لَا نُفَرِّقُ  بَيْنَ  أَحَدٍ  مِنْ  رُسُلِهِ ۚ  وَقَالُوا  سَمِعْنَا  وَأَطَعْنَا ۖ  غُفْرَانَكَ  رَبَّنَا  وَإِلَيْكَ  الْمَصِيرُ.  لَا يُكَلِّفُ  اللَّهُ  نَفْسًا  إِلَّا  وُسْعَهَا  لَهَا  مَا  كَسَبَتْ  وَعَلَيْهَا  مَا  اكْتَسَبَتْ  رَبَّنَا  لَا  تُؤَاخِذْنَا  إِنْ  نَّسِينَآ  أَوْ  أَخْطَأْنَا  رَبَّنَا  وَلَا  تَحْمِلْ  عَلَيْنَا  إِصْرًا  كَمَا  حَمَلْتَهُ  عَلَى  الَّذِينَ  مِنْ  قَبْلِنَا  رَبَّنَا  وَلَا  تُحَمِّلْنَا  مَا  لَا  طَاقَةَ  لَنَا  بِهِ  وَاعْفُ  عَنَّا  وَاغْفِرْ  لَنَا  وَارْحَمْنَا  أَنْتَ  مَوْلَانَا  فَانْصُرْنَا  عَلَى  الْقَوْمِ  الْكَافِرِينَ»'),
  Dua(
      header: 'دعاء ٣',
      title: "",
      description:
          'قراءة  سورة  الإخلاص  ( 3 مرّات): بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم  قُلْ  هُوَ  اللَّهُ  أَحَدٌ  (1) اللَّهُ الصَّمَدُ  (2) لَمْ  يَلِدْ  وَلَمْ  يُولَدْ  (3) وَلَمْ  يَكُنْ  لَهُ  كُفُوًا  أَحَدٌ  (4).'),
  Dua(
      header: 'دعاء ٤',
      title: "",
      description:
          'قراءة  سورة  الفلق  (3 مرّات):بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم  قُلْ  أَعُوذُ  بِرَبِّ  الْفَلَقِ (1) مِنْ  شَرِّ  مَا  خَلَقَ (2) وَمِنْ  شَرِّ  غَاسِقٍ  إِذَا  وَقَبَ (3) وَمِنْ  شَرِّ  النَّفَّاثَاتِ  فِي  الْعُقَدِ (4) وَمِنْ  شَرِّ  حَاسِدٍ  إِذَا  حَسَدَ  (5). '),
  Dua(
    header: 'دعاء ٥',
    title: "",
    description: 'قراءة سورة الملك',
  ),
  Dua(
    header: 'دعاء ٦',
    title: "",
    description:
        ' لم  يكن  رسولُ  اللهِ  -  صلَّى  اللهُ  عليهِ  وسلَّم -  يدعُ  هؤلاءِ  الدعواتِ  حين  يُمسي  وحين  يُصبحُ،  اللهمَّ  إني  أسألُك العفوَ  والعافيةَ،  في  الدنيا  والآخرةِ،  اللهمَّ  إني  أسألُك  العفوَ  والعافيةَ،  في دِيني  ودنيايَ  وأهلي  ومالي،  اللهمَّ  استُرْ  عوراتي،  وآمِنْ  روعاتي،  واحفظني  من  بين  يدي،  ومن  خلفي،  وعن  يميني،  وعن  شمالي،  ومن  فوقي،  وأعوذُ  بك  أن  أُغْتَالَ  من  تحتي',
  ),
  Dua(
      header: 'دعاء ٧',
      title: "يقول",
      description:
          ' بِسـمِ  اللهِ  الذي  لا  يَضُـرُّ  مَعَ  إسمِـهِ  شَيءٌ  في  الأرْضِ    وَلا في  السّمـاءِ  وَهـوَ  السّمـيعُ  العَلـيم.  (3 مرات). '),
  Dua(
      header: 'دعاء ٨',
      title: "يقول",
      description:
          ' اللّهُـمَّ  إِنّـي  أَعوذُ  بِكَ  مِنَ  الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ  بِكَ  مِنْ  عَذابِ  القَـبْر ، لا  إلهَ  إلاّ  أَنْـتَ. (3 مرات).'),
  Dua(
      header: 'دعاء ٩',
      title: "يقول",
      description:
          'يَا  حَيُّ  يَا  قيُّومُ  بِرَحْمَتِكَ  أسْتَغِيثُ  أصْلِحْ  لِي  شَأنِي  كُلَّهُ  وَلاَ  تَكِلْنِي  إلَى  نَفْسِي  طَـرْفَةَ  عَيْنٍ. (3 مرات). '),
];

final List<Dua> prayerDuasList = const [
  Dua(
      header: 'أدعية استفتاح الصلاة',
      title: "يقول",
      description: 'سبحانك اللهم وبحمدك وتبارك  اسمك وتعالى جدك ولا إله غيرك.'),
  Dua(
      header: 'أدعية استفتاح الصلاة',
      title: "يقول",
      description:
          'اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس،، اللهم اغسلني من خطاياي بالثلج والماء والبرد.'),
  Dua(
      header: 'أدعية استفتاح الصلاة',
      title: "يقول",
      description:
          ' وَجَّهْتُ  وَجْهِيَ  لِلَّذِي  فَطَرَ  السَّمَاوَاتِ  وَالْأَرْضَ  حَنِيفًا،  وَمَا  أَنَا  مِنَ  الْمُشْرِكِينَ،  إِنَّ  صَلَاتِي،  وَنُسُكِي،  وَمَحْيَايَ،  وَمَمَاتِي  لِلَّهِ  رَبِّ  الْعَالَمِينَ،  لَا شَرِيكَ  لَهُ،  وَبِذَلِكَ  أُمِرْتُ  وَأَنَا  مِنَ  الْمُسْلِمِينَ،  اللهُمَّ  أَنْتَ  الْمَلِكُ  لَا  إِلَهَ  إِلَّا  أَنْتَ  أَنْتَ  رَبِّي،  وَأَنَا  عَبْدُكَ،  ظَلَمْتُ  نَفْسِي،  وَاعْتَرَفْتُ  بِذَنْبِي،  فَاغْفِرْ  لِي  ذُنُوبِي  جَمِيعًا،  إِنَّهُ  لَا  يَغْفِرُ  الذُّنُوبَ  إِلَّا  أَنْتَ ، وَاهْدِنِي  لِأَحْسَنِ  الْأَخْلَاقِ  لَا  يَهْدِي  لِأَحْسَنِهَا  إِلَّا  أَنْتَ،  وَاصْرِفْ  عَنِّي  سَيِّئَهَا  لَا  يَصْرِفُ  عَنِّي  سَيِّئَهَا  إِلَّا  أَنْتَ،  لَبَّيْكَ  وَسَعْدَيْكَ  وَالْخَيْرُ  كُلُّهُ  فِي  يَدَيْكَ،  وَالشَّرُّ  لَيْسَ  إِلَيْكَ،  أَنَا  بِكَ  وَإِلَيْكَ،  تَبَارَكْتَ  وَتَعَالَيْتَ،  أَسْتَغْفِرُكَ  وَأَتُوبُ  إِلَيْكَ.'),
  Dua(
      header: 'دعاء بعد الصلاة',
      title: "يقول",
      description:
          ' أَسْـتَغْفِرُ  الله  (ثَلاثًا) أستغفرُ  الله،  أستغفرُ  الله،  أستغفرُ  الله،  اللهم  أنتَ  السلامُ  ومنكَ  السلامُ،  تباركتَ  يا  ذا الجلالِ  والإكرام.  • لا  إلهَ  إلاّ  اللّهُ  وحدَهُ  لا  شريكَ  لهُ،  لهُ  المُـلْكُ  ولهُ  الحَمْد،  وهوَ على  كلّ  شَيءٍ  قَدير،  اللّهُـمَّ  لا  مانِعَ  لِما  أَعْطَـيْت،  وَلا مُعْطِـيَ  لِما  مَنَـعْت،  وَلا  يَنْفَـعُ  ذا  الجَـدِّ  مِنْـكَ  الجَـد.  [البخاري 1/255 ومسلم 414] •لا  إله  إلا  الله  وحدهُ  لا  شريكَ  لهُ،  لهُ  الملكُ  ولهُ  الحمدُ،  وهوَ  على  كلِّ  شيءٍ  قدير،  لا  حولَ  ولا  قوةَ  إلا بالله،  لا  إله  إلا  الله،  ولا  نعبدُ  إلا  إياهُ،  لهُ  النعمةُ  ولهُ  الفضلُ  ولهُ  الثناءُ  الحسنُ،  لا  إله  إلا  الله  مُخلصينَ  له  الدينَ  ولو  كرِهَ  الكافرون •'),
];
